import streamlit as st
from PIL import Image
def page_two():
    st.title("พันธ์ุวัววากิว")

    st.header("Japanese Black หรือ เนื้อพันธุ์ญี่ปุ่นขนดำ")
    image = Image.open('black.png')
    st.markdown("เนื้อพันธุ์ญี่ปุ่นขนดำ หรือ คุโรเกะวากิว นิยมเลี้ยงในภูมิภาคคันไซและชุโกคุ โดยนับว่าเป็นสายพันธุ์เนื้อวัวที่สุดยอดอันดับต้น ๆ เพราะลำตัวของวัวมีขนาดที่ใหญ่ และมีขนสีดำเงางาม ส่วนความเด็ดดวงของเนื้อชนิดนี้ เป็นเนื้อที่มีสีแดงสด มีไขมันแทรกในเนื้อที่เยอะมาก ๆ แถมเนื้อนุ่มนวล ละลายในลิ้น ถ้าได้ลิ้มลองบอกได้เลยว่าฟิน เหมือนอยู่ในสวรรค์ของเนื้ออย่างแน่นอน นอกจากนี้ยังมาพร้อมไปด้วยโภชนาการต่าง ๆ ที่ดีต่อร่างกาย เช่น โอเมก้า 3 และ โอเมก้า 6 อีกด้วย  ")



    st.image(image, caption='Japanese Black')

    st.header("Japanese Brown หรือ เนื้อพันธุ์ญี่ปุ่นขนน้ำตาล")
    image = Image.open('brown.jpg')
    st.markdown('เนื้อพันธุ์ญี่ปุ่นขนน้ำตาล หรือ เนื้ออากะอูชิวากิว เป็นเนื้อที่นิยมเลี้ยงใน จังหวัดมาโมโต้และโคจิ มีความนุ่ม หอมหวาน และรสชาติดี ถึงแม้ว่าเนื้อชนิดนี้จะไม่มีไขมันแทรกเนื้อที่เยอะเทียบเท่ากับเนื้อคุโรเกะวากิว เพราะปริมาณไขมันในเนื้อที่น้อย มีเพียงแค่ประมาณ 12% จึงเหมาะสำหรับผู้ที่รับประทานเพื่อสุขภาพ')

    st.image(image, caption='Japanese Brown')

    st.header("Japanese Shorthorn หรือ เนื้อพันธุ์ญี่ปุ่นเขาสั้น")
    image = Image.open('short.jpg')
    st.markdown('เนื้อพันธุ์ญี่ปุ่นเขาสั้น หรือ เนื้ออิวะเตะกิว เป็นเนื้อที่นิยมเลี้ยงในภูมิภาคโทโฮคุตอนเหนือ เนื้อวัวสายพันธุ์นี้จะให้เนื้อที่บาง มีสีแดงเข้ม มีโปรตีนที่สูง ไขมันน้อย และเนื้อชนิดนี้จะมีกรดอะมิโนที่ทำให้รสชาติอร่อยยิ่งขึ้น')

    st.image(image, caption='Japanese Shorthorn')

    st.header("Japanese Polled หรือ เนื้อพันธุ์ญี่ปุ่นไม่มีเขา")
    image = Image.open('A-Wagyu.jpg')
    st.markdown(
        'เนื้อพันธุ์ญี่ปุ่นไม่มีเขา เป็นเนื้อที่นิยมเลี้ยงใน จังหวัดยามางุจิ มีจุดเด่นคือเนื้อมีปริมาณที่สูง มีความเหนียว รสชาติเข้มข้น เหมาะสำหรับอาหารประเภทเนื้อย่างหรือสเต๊ก')

    st.image(image, caption='Japanese Polled')

    st.markdown("ข้อมูลจาก:https://www.okushouhin.com/")