import streamlit as st
from PIL import Image
def page_three():
    st.title("พันธ์ุวัวเนื้อ")
    st.header("วัวพันธุ์พื้นเมือง")
    image = Image.open('floor.jpg')
    st.markdown(
        'มีลำตัวขนาดเล็ก มีสีแตกต่างกันหลายสี เช่น แดง ดำ น้ำตาล ตะโหนกเล็ก เหนียงคอบางไม่มีหนังใต้ท้องหน้าผากแคบแบน นิสัยเปรียว ตกใจง่าย ให้ลูกดกและสม่ำเสมอ ทนต่ออากาศร้อนโรคและแมลงได้ดี เป็นโคที่เลี้ยงง่าย หากินเก่ง ไม่เลือกอาหาร')

    st.image(image, caption='วัวพันธุ์พื้นเมือง')

    st.header("วัวพันธุ์บราห์มัน")
    image = Image.open('Brahman.jpg')
    st.markdown(
        'มีต้นกำเนิดในประเทศอินเดีย แต่ถูกปรับปรุงพันธุ์ที่ประเทศสหรัฐอเมริกา เป็นโคที่มีขนาดค่อนข้างใหญ่ ลำตัวกว้าง ยาว และลึก ได้สัดส่วน หลังตรง หนอกใหญ่ หูใหญ่ยาว จมูก ริมฝีปาก ขนตา กีบเท้าและหนังเป็นสีดำ เหนียงทีคอและหนังใต้ท้องหย่อนยาน โคนหางใหญ่ พู่หางสีดำ สีจะมีสีเขา เทา และแดง ที่นิยมเลี้ยงกันมากคือสีขาว เพศผู้โตเต็มที่หนักประมาณ 800-1,200 ก.ก. เพศเมียประมาณ 500-700 ก.ก.')

    st.image(image, caption='วัวพันธุ์บราห์มัน')

    st.header("วัวพันธุ์ชาร์โรเล่ส์")
    image = Image.open('Charolais.png')
    st.markdown(
        'พันธุ์นี้มาจากฝรั่งเศส มีสีขาวครีมทั้งตัว ขาสั้น ลำตัวกว้าง ยาว และลึก มีกล้ามเนื้อตลอดทั้งตัว มีกล้ามเนื้อเป็นมัดสวยงามเป็นโคขนาดใหญ่ มีอัตราการเจริญเติบโตเร็ว ซากมีขนาดใหญ่ เนื้อนุ่ม มักนำมาผสมข้ามพันธุ์ให้ลูกผสมโตเร็วมีเนื้อมาก ตัวผู้มีขนาด 900-1,100 กก. ตัวเมียหนัก 680-800 กก. มีทั้งพวกที่มีเขาและไม่มีเขา')

    st.image(image, caption='วัวพันธุ์ชาร์โรเล่ส์')

    st.header("วัวพันธุ์ซิมเมนทัล")
    image = Image.open('Simmentaler.jpg')
    st.markdown(
        'ถิ่นกำเนิดเดิมอยู่ในประเทศสวิสเซอร์แลนด์ มีขนาดใหญ่ให้เนื้อดี ลักษณะสีแดงออกเหลืองมีด่างขาวตามลำตัวโดยเฉพาะใบหน้าใต้ท้องและพู่หาง โตเร็ว มีเนื้อมาก ซากมีไขมันน้อย ตัวผู้หนัก 900-1,100 กก. ตัวเมียหนัก 680-800 กก. มีการเติบโตเร็ว ซากมีขนาดใหญ่ เนื้อนุ่ม เนื้อสันมีไขมันแทรก (marbling) เป็นที่ต้องการของตลาดเนื้อโคคุณภาพดี')

    st.image(image, caption='วัวพันธุ์ซิมเมนทัล')

    st.header("วัวพันธุ์ตาก")
    image = Image.open('prakobbeef.jpg')
    st.markdown(
        ' เป็นโคลูกผสมระหว่างพันธุ์ชาร์โรเล่ส์กับพันธุ์บราห์มัน เป็นโคที่มีขนาดใหญ่ปานกลาง อกกว้างและลึกมาก หลังตรง สะโพกใหญ่ ไหล่หนา คอสั้น ลำตัวมองดูเป็นสี่เหลี่ยมผืนผ้า มีกล้ามเนื้อมาก ขนมีลักษณะสั้นเกรียน สีขาวครีมหรือน้ำตาลอ่อน หูกางขนาดเล็กและสั้นพอสมควร มีตะโหนกเพียงเล็กน้อย เหนียงคอหย่อนยานพอสมควร หนังสะดือหย่อนยานเล็กน้อยเพศผู้โตเต็มที่น น้ำหนักประมาณ 900-1,000 กก. เพศเมีย 600-700 กก. เติบโตเร็ว เนื้อนุ่ม เนื้อสันมีไขมันแทรก')

    st.image(image, caption='วัวพันธุ์ตาก')

    st.header("วัวพันธุ์กำแพงแสน")
    image = Image.open('kum.jpg')
    st.markdown(
        'เป็นการปรับปรุงพันธุ์โคเนื้อโคพื้นเมืองของไทย ที่มีคุณสมบัติที่ดีเลิศในเรื่องความสมบูรณ์ คือ เป็นสัดเร็ว ผสมติดง่าย ได้ลูกทุกปี มีขนาดลำตัวเล็กและโตช้า จึงได้มีการปรับปรุงโคพื้นเมือง โดยนำโคบราห์มันเข้ามาผสมเพื่อให้ได้ลูกโคที่มีขนาดใหญ่และโตเร็วขึ้น ส่วนลักษณะและคุณสมบัติอื่นๆ คล้ายกับโคพันธุ์ตาก')

    st.image(image, caption='วัวพันธุ์กำแพงแสน')

    st.header("วัวพันธุ์กบินทร์บุรี")
    image = Image.open('kabin1.jpg')
    st.markdown(
        'เป็นโคลูกผสมระหว่างพันธุ์ซิมเมนทาลกับพันธุ์บราห์มัน มีสีแดงเข้มคล้ายโคพันธุ์ซิมเมนทาล เป็นโคขนาดกลาง เพศผู้โตเต็มที่น้ำหนักประมาณ 900 ถึง 1,000 กิโลกรัม เพศเมีย 600 ถึง 700 กิโลกรัม หากเลี้ยงแบบโคเนื้อมีการเติบโตเร็ว ซากมีขนาดใหญ่ที่สนองความต้องการของตลาดเนื้อโคคุณภาพดีได้')

    st.image(image, caption='วัวพันธุ์กบินทร์บุรี')

    st.header("วัวพันธุ์ฮินดูบราซิล")
    image = Image.open('Rsiamindu.jpg')
    st.markdown(
        'มีเชื้อสายโคอินเดียเช่นเดียวกับโคบราห์มัน แต่ปรับปรุงพันธุ์ที่ประเทศบราซิล สีมีตั้งแต่สีขาวจนถึงสีเทาเกือบดำ สีแดง แดงเรื่อๆ หรือแดงจุดขาว หน้าผากโหนกกว้างค่อนข้างยาว หูมีขนาดกว้างปานกลางและห้อยยาวมาก ปลายใบหูมักจะบิด เขาแข็งแรงมักจะเอนไปด้านหลัง หนอกมีขนาดใหญ่ ผิวหนังและเหนียงหย่อนยานมาก เป็นโคที่มีขนาดใหญ่และค่อนข้างสูง เพศผู้โตเต็มที่หนักประมาณ 900-1,200 ก.ก. เพศเมีย 600-700 ก.ก.')

    st.image(image, caption='วัวพันธุ์ฮินดูบราซิล')

    st.markdown("ข้อมูลจาก:https://farmermee.com")

